---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Part
source: html/ca94b36d-4f9a-091d-b31e-a32a16ec89ac.htm
---
# Part Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.